---
kind: method
id: M:Autodesk.Revit.DB.Element.IsMonitoringLocalElement
zh: 构件、图元、元素
source: html/9a41a87c-2b3b-b6ed-1743-98c002b20ce3.htm
---
# Autodesk.Revit.DB.Element.IsMonitoringLocalElement Method

**中文**: 构件、图元、元素

Indicate whether an element is monitoring other local elements.

## Syntax (C#)
```csharp
public bool IsMonitoringLocalElement()
```

## Returns
True if this element is monitoring other elements in same project. Otherwise, false will be returned.